app/controllers/api/sessions_controller.rb

    def create
        @user = User.find_by_credentials(params[:user][:loginInfo], params[:user][:password])

        if @user
            login!(@user)
            render "api/users/show"
        else
            if (params[:user][:password].length == 0)
---
SELECT  "users".* FROM "users" WHERE (orenshaf@gmail.com) LIMIT $1  [["LIMIT", 1]]