app/controllers/api/sessions_controller.rb

    def check_email
        @user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "orenshaf@gmail.com"], ["LIMIT", 1]]