app/controllers/api/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
    def index
        @tracks = Track.all

INSERT INTO "tracks" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Street Fighter"], ["user_id", 1], ["created_at", "2019-06-03 19:50:16.596364"], ["updated_at", "2019-06-03 19:50:16.596364"]]
---
    def create
        @track = Track.new(track_params)

        if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "tracks" SET "updated_at" = $1 WHERE "tracks"."id" = $2  [["updated_at", "2019-06-04 23:26:51.360813"], ["id", 2]]
---
    def update
        @track = Track.find_by(id: params[:track][:id])

        if @user.update(track_params)