app/controllers/api/tracks_controller.rb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."user_id" = $1  [["user_id", 1]]
---
    def index
        @tracks = Track.all.with_attached_photo.with_attached_track_file.includes(:user)