app/controllers/api/tracks_controller.rb

    def index
        @tracks = Track.limit(10)
---
SELECT  "tracks".* FROM "tracks" LIMIT $1  [["LIMIT", 11]]

    def show
        @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]