app/controllers/api/users_controller.rb

    def check_email
        @user = User.find_by(email: params[:loginInfo]) || User.find_by(profile_url: params[:loginInfo])
---
SELECT  "users".* FROM "users" WHERE "users"."profile_url" = $1 LIMIT $2  [["profile_url", "orenshaf@gmail.com"], ["LIMIT", 1]]

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at", "profile_url", "age", "gender") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def update
        @user = User.find_by(id: params[:user][:id]) || User.find_by(email: params[:user][:email])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "finalfinalfinaltest@test.com"], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "oren"], ["password_digest", "$2a$10$9VQ6A.Cc6.l7n4RCqnEX3eFtM81VLSw8WWFxn3t26iNYbgM2QURsa"], ["updated_at", "2019-06-01 21:19:13.069147"], ["id", 21]]