app/models/user.rb

    def self.find_by_credentials(loginInfo, password)
        user = User.find_by(email: loginInfo) || User.find_by(profile_url: loginInfo)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@soundproud.com"], ["LIMIT", 1]]